app/controllers/authentications_controller.rb

INSERT INTO `authentications` (`created_at`, `provider`, `uid`, `updated_at`, `user_id`) VALUES ('2012-02-06 08:50:42', 'facebook', '549928562', '2012-02-06 08:50:42', 1)
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`user_id` = 1 AND `authentications`.`provider` = 'facebook' AND `authentications`.`uid` = '549928562' LIMIT 1
---
	def create
	  auth = request.env["omniauth.auth"]
	  out = current_user.authentications.find_or_create_by_provider_and_uid(auth['provider'], auth['uid'])