app/controllers/authentications_controller.rb

	def create
	  auth = request.env["omniauth.auth"]
	  current_user.authorizations.find_or_create_by_provider_and_uid(auth['provider'], auth['uid'])
---
SELECT `authorizations`.* FROM `authorizations` WHERE `authorizations`.`user_id` = 2 AND `authorizations`.`provider` = 'facebook' AND `authorizations`.`uid` = '549928562' LIMIT 1