app/controllers/game_controller.rb

SELECT `gameones`.* FROM `gameones` WHERE `gameones`.`state` = -1 LIMIT 1
UPDATE `gameones` SET `user2` = 2, `state` = 0, `updated_at` = '2012-02-06 21:47:37' WHERE `gameones`.`id` = 1
INSERT INTO `gameones` (`accept`, `created_at`, `moneyontable`, `offer`, `state`, `updated_at`, `user1`, `user2`) VALUES (NULL, '2012-02-06 21:47:30', NULL, NULL, -1, '2012-02-06 21:47:30', 1, NULL)
---
	def create
	  @game = Gameone.find_by_state(WAIT);
	  if @game
	    @game.user2 = 2
	    @game.state = CONNECTED
	    @game.save
	    render :template => "/game/create", :locals => {:uid => 2, :gameid => @game.id}
	  else
	    game = Gameone.new :user1 => 1, :state => WAIT
      game.save

SELECT `gameones`.* FROM `gameones` WHERE `gameones`.`id` = 3 LIMIT 1
UPDATE `gameones` SET `offer` = 0.5, `updated_at` = '2012-02-06 21:59:28' WHERE `gameones`.`id` = 3
---
	def propose
	  @sender = params[:sender]
	  @gameid = params[:gameid]
	  @game = Gameone.find_by_id(@gameid)
	  @game.offer = params[:offer]
	  @game.save

SELECT `gameones`.* FROM `gameones` WHERE `gameones`.`id` = 3 LIMIT 1
---
  def respond
     @sender = params[:sender]
     @gameid = params[:gameid]
  	 @message = {:state => 2, :decision => params[:decision]}
  	 @game = Gameone.find_by_id(@gameid)