app/controllers/sessions_controller.rb

SELECT `authorizations`.* FROM `authorizations` WHERE `authorizations`.`provider` = 'facebook' AND `authorizations`.`uid` = '100000278151450' LIMIT 1
INSERT INTO `authorizations` (`created_at`, `provider`, `uid`, `updated_at`, `user_id`) VALUES ('2012-02-04 04:52:30', 'facebook', '100000278151450', '2012-02-04 04:52:30', 1)
INSERT INTO `users` (`created_at`, `email`, `name`, `updated_at`) VALUES ('2012-02-04 04:52:30', 'ccwei@stanford.edu', 'Chih-Chiang Wei', '2012-02-04 04:52:30')
---
  def create
      @authorization = Authorization.find_by_provider_and_uid(auth_hash["provider"], auth_hash["uid"])
      if @authorization
        render :text => "Welcome back #{@authorization.user.name}! You have already signed up."
      else
        user = User.new :name => auth_hash["info"]["name"], :email => auth_hash["info"]["email"]
        user.authorizations.build :provider => auth_hash["provider"], :uid => auth_hash["uid"]
        user.save